#include <iostream>
#include <vector>
#include <limits>
using namespace std;

int main()
{
    int N, B, A1;

    // Запитуємо розмір масиву
    cout << "Розмір масиву (N): ";
    cin >> N;

    // Створюємо вектор для елементів масиву
    vector<int> A(N);

    // Запитуємо елементи масиву
    cout << "Елементи масиву A: ";
    for (int i = 0; i < N; i++)
    {
        cin >> A[i];
    }

    // Запитуємо значення B
    cout << "Введіть B: ";
    cin >> B;

    // Запитуємо значення A1
    cout << "Введіть A1: ";
    cin >> A1;

    // Ініціалізуємо minValue найбільшим можливим значенням
    int minValue = numeric_limits<int>::max();

    // Проходимо масив, щоб знайти мінімальне значення серед елементів менших за B,
    // розташованих до першого елемента A1
    for (int i = 0; i < N; i++)
    {
        // Якщо зустрічаємо перший елемент, рівний A1, припиняємо пошук
        if (A[i] > A1) break;

        // Якщо елемент менший за B і менший за поточне мінімальне значення, оновлюємо мінімум
        if (A[i] < B && A[i] < minValue)
        {
            minValue = A[i];
        }
    }

    // Якщо ми знайшли мінімальне значення, виводимо його
    if (minValue != numeric_limits<int>::max())
    {
        cout << "Мінімальне значення серед елементів менших за B і розташованих до першого A1: " << minValue << endl;
    }
    else  // Якщо мінімального значення не знайдено
    {
        cout << "Відповідь не знайдено" << endl;
    }

    return 0;
}
